app/Controllers/Auth.php

    public function process()
    {
        $session = session();
        $model = new UserModel();
        $logModel = new ActivityLogModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin123'
 LIMIT 1