app/Controllers/Categories.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $model = new CategoryModel();
        $data['categories'] = $model->findAll();

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Hygeine', '2026-05-07 09:18:31', '2026-05-07 09:18:31')
---
    public function store()
    {
        $model = new CategoryModel();
        $data = [
            'name' => $this->request->getPost('name'),
        ];
        $model->save($data);