app/Controllers/Dashboard.php

    public function index()
    {
        $listahanModel = new ListahanModel();
        $inventoryModel = new InventoryModel();
        $transactionModel = new TransactionModel();

        // 1. Calculate Today's Revenue (Sum of amount_paid for today)
        $today = date('Y-m-d');
        $revenueData = $transactionModel->selectSum('amount_paid')
                                      ->like('created_at', $today, 'after')
                                      ->first();
        $todayRevenue = $revenueData['amount_paid'] ?? 0;

        // 2. Active Listahan Count
        $activeListahan = $listahanModel->countAllResults();

        // 3. Low Stock Alerts (Stock <= 5)
        $lowStockCount = $inventoryModel->where('stock <=', 5)->countAllResults();

        // 4. Fetch Sales Analytics Data
        $db = \Config\Database::connect();

        // Daily Sales (Last 7 days)
        $dailySales = $db->table('transactions')
            ->select("DATE(created_at) as date, SUM(amount_paid) as total")
            ->where('created_at >=', date('Y-m-d', strtotime('-7 days')))
            ->groupBy("date")
            ->orderBy("date", "ASC")
            ->get()->getResultArray();

        // Weekly Sales (Last 4 weeks)
        $weeklySales = $db->table('transactions')
            ->select("YEARWEEK(created_at) as week, SUM(amount_paid) as total")
            ->where('created_at >=', date('Y-m-d', strtotime('-4 weeks')))
            ->groupBy("week")
            ->orderBy("week", "ASC")
            ->get()->getResultArray();

        // Monthly Sales (Last 6 months)
        $monthlySales = $db->table('transactions')
            ->select("DATE_FORMAT(created_at, '%Y-%m') as month, SUM(amount_paid) as total")
            ->where('created_at >=', date('Y-m-d', strtotime('-6 months')))
            ->groupBy("month")
            ->orderBy("month", "ASC")
            ->get()->getResultArray();
---
SELECT SUM(`amount_paid`) AS `amount_paid`
FROM `transactions`
WHERE `created_at` LIKE '2026-05-14%' ESCAPE '!'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `listahan`
SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE `stock` <= 5
SELECT DATE(created_at) as date, SUM(amount_paid) as total
FROM `transactions`
WHERE `created_at` >= '2026-05-07'
GROUP BY `date`
ORDER BY `date` ASC
SELECT YEARWEEK(created_at) as week, SUM(amount_paid) as total
FROM `transactions`
WHERE `created_at` >= '2026-04-16'
GROUP BY `week`
ORDER BY `week` ASC
SELECT DATE_FORMAT(created_at, '%Y-%m') as month, SUM(amount_paid) as total
FROM `transactions`
WHERE `created_at` >= '2025-11-14'
GROUP BY `month`
ORDER BY `month` ASC