app/Controllers/Inventory.php

SELECT *
FROM `inventory`
---
    public function index()
    {
        $model = new InventoryModel();
        $categoryModel = new CategoryModel();

        $inventory = $model->findAll();