app/Controllers/Listahan.php

    public function store()
    {
        $model = new ListahanModel();

        // Use custom due date if provided, otherwise default to 7 days from now
        $dueDate = $this->request->getPost('due_date');
        if (empty($dueDate)) {
            $dueDate = date('Y-m-d', strtotime('+7 days'));
        }

        $model->save([
            'customer_name' => $this->request->getPost('customer_name'),
            'email'         => $this->request->getPost('email'),
            'items'         => $this->request->getPost('items'),
            'amount'        => $this->request->getPost('amount'),
            'due_date'      => $dueDate,
            'status'        => 'unpaid'
        ]);
---
INSERT INTO `listahan` (`customer_name`, `email`, `items`, `amount`, `due_date`, `status`) VALUES ('Nyve Gajo', 'nayeoungi@gmail.com', 'tinapa', '20', '2026-05-31', 'unpaid')