app/Controllers/Listahan.php

SELECT *
FROM `listahan`
ORDER BY `created_at` DESC
---
        }

        $model = new ListahanModel();
        $data['listahan'] = $model->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `listahan`
WHERE `listahan`.`id` = '17'
INSERT INTO `transactions` (`customer_name`, `payment_method`, `total_amount`, `amount_paid`, `items_json`) VALUES ('Jayven gajo', 'gcash', '20.00', 20, '[{\"name\":\"Debt Settlement: kape\",\"qty\":1,\"price\":20}]')
DELETE FROM `listahan`
WHERE `id` IN ('17')
---
    public function settle($id)
    {
        $listahanModel = new ListahanModel();
        $transactionModel = new TransactionModel();
        $logModel = new ActivityLogModel();

        $debt = $listahanModel->find($id);
        if ($debt) {
            $method = $this->request->getGet('method') ?? 'cash';
            $amountToPay = $this->request->getGet('amount') ? floatval($this->request->getGet('amount')) : floatval($debt['amount']);

            // Record as transaction
            $transactionModel->save([
                'customer_name'  => $debt['customer_name'],
                'payment_method' => $method,
                'total_amount'   => $debt['amount'], // The original debt amount for this transaction
                'amount_paid'    => $amountToPay,
                'items_json'     => json_encode([['name' => ($method === 'partial' ? 'Partial ' : '') . 'Debt Settlement: ' . $debt['items'], 'qty' => 1, 'price' => $amountToPay]])
            ]);

            if ($method === 'partial' && $amountToPay < $debt['amount']) {
                // Update the remaining debt
                $newAmount = $debt['amount'] - $amountToPay;
                $listahanModel->update($id, ['amount' => $newAmount]);

                $logModel->log('Debt Partial Payment', "Received ₱{$amountToPay} from {$debt['customer_name']}. Remaining: ₱{$newAmount}");

                return redirect()->to('/listahan')->with('status', 'Partial payment of ₱' . number_format($amountToPay, 2) . ' received. Remaining debt: ₱' . number_format($newAmount, 2));
            } else {
                // Full settlement
                $listahanModel->delete($id);