app/Controllers/Listahan.php

    public function index()
    {
        $model = new ListahanModel();
        $data['listahan'] = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `listahan`
ORDER BY `created_at` DESC

    public function store()
    {
        $model = new ListahanModel();
        $model->save([
            'customer_name' => $this->request->getPost('customer_name'),
            'items'         => $this->request->getPost('items'),
            'amount'        => $this->request->getPost('amount'),
            'status'        => 'unpaid'
        ]);
---
INSERT INTO `listahan` (`customer_name`, `items`, `amount`, `due_date`, `status`) VALUES ('Josev Kiervin Gajo', 'coffee', '30', '2026-05-30', 'unpaid')