app/Controllers/Pos.php

    public function index()
    {
        $db = \Config\Database::connect();
        if (!$db->fieldExists('icon', 'categories')) {
            $forge = \Config\Database::forge();
            $fields = [
                'icon' => [
                    'type' => 'VARCHAR',
                    'constraint' => 50,
                    'default' => 'fas fa-box',
                    'after' => 'name'
                ],
            ];
            $forge->addColumn('categories', $fields);
        }

        $inventoryModel = new InventoryModel();
        $categoryModel = new CategoryModel();

        $products = $inventoryModel->findAll();
        $categories = $categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function checkout()
    {
        $json = $this->request->getJSON();
        if (!$json) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Invalid data']);
        }

        $inventoryModel = new InventoryModel();
        $listahanModel = new ListahanModel();
        $transactionModel = new TransactionModel();
        $logModel = new ActivityLogModel();
        $db = \Config\Database::connect();

        $db->transStart();

        // 1. Update Inventory Stock & Handle Permanent Custom Items
        foreach ($json->items as $item) {
            if ($item->id > 0) {
                // Regular inventory item
                $product = $inventoryModel->find($item->id);
                if ($product) {
                    $newStock = $product['stock'] - $item->qty;
                    if ($newStock < 0) {
                        $db->transRollback();
                        return $this->response->setJSON(['status' => 'error', 'message' => 'Insufficient stock for ' . $item->name]);
                    }
                    $inventoryModel->update($item->id, ['stock' => $newStock]);
---
SELECT *
FROM `inventory`
WHERE `inventory`.`id` = 3
UPDATE `inventory` SET `stock` = 13
WHERE `inventory`.`id` IN (3)

        }

        // 3. Save Transaction for Revenue Tracking
        $transactionModel->save([
            'customer_name'  => $json->customer_name,
            'payment_method' => $json->payment_method,
            'total_amount'   => $json->total_amount,
            'amount_paid'    => $json->amount_paid,
            'items_json'     => json_encode($json->items)
        ]);
---
INSERT INTO `transactions` (`customer_name`, `payment_method`, `total_amount`, `amount_paid`, `items_json`) VALUES ('Jayven Kim Gajo', 'cash', 40, 40, '[{\"id\":3,\"name\":\"colgate\",\"qty\":1,\"price\":20},{\"id\":6,\"name\":\"coke\",\"qty\":1,\"price\":20}]')