app/Controllers/Pos.php

SELECT *
FROM `inventory`
---
    public function index()
    {
        $inventoryModel = new InventoryModel();

        $data = [
            'title' => 'Point of Sale',
            'products' => $inventoryModel->findAll()
        ];

SELECT *
FROM `inventory`
WHERE `inventory`.`id` = 4
UPDATE `inventory` SET `stock` = 9
WHERE `inventory`.`id` IN (4)
---
    public function checkout()
    {
        $json = $this->request->getJSON();
        if (!$json) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Invalid data']);
        }

        $inventoryModel = new InventoryModel();
        $listahanModel = new ListahanModel();
        $transactionModel = new TransactionModel();
        $db = \Config\Database::connect();

        $db->transStart();

        // 1. Update Inventory Stock
        foreach ($json->items as $item) {
            $product = $inventoryModel->find($item->id);
            if ($product) {
                $newStock = $product['stock'] - $item->qty;
                if ($newStock < 0) {
                    $db->transRollback();
                    return $this->response->setJSON(['status' => 'error', 'message' => 'Insufficient stock for ' . $item->name]);
                }
                $inventoryModel->update($item->id, ['stock' => $newStock]);

INSERT INTO `listahan` (`customer_name`, `items`, `amount`, `status`) VALUES ('Lisa Gajo', '1x Camel, 1x colgate', 30, 'unpaid')
---
                    return $item->qty . 'x ' . $item->name;
                }, $json->items);

                $listahanModel->save([
                    'customer_name' => $json->customer_name,
                    'items'         => implode(', ', $itemNames),
                    'amount'        => $amountOwed,
                    'status'        => 'unpaid'
                ]);

INSERT INTO `transactions` (`customer_name`, `payment_method`, `total_amount`, `amount_paid`, `items_json`) VALUES ('Lisa Gajo', 'utang', 30, 30, '[{\"id\":4,\"name\":\"Camel\",\"qty\":1,\"price\":10},{\"id\":3,\"name\":\"colgate\",\"qty\":1,\"price\":20}]')
---
        }

        // 3. Save Transaction for Revenue Tracking
        $transactionModel->save([
            'customer_name'  => $json->customer_name,
            'payment_method' => $json->payment_method,
            'total_amount'   => $json->total_amount,
            'amount_paid'    => $json->amount_paid,
            'items_json'     => json_encode($json->items)
        ]);