app/Controllers/Stock.php

    public function index() {
        $model = new InventoryModel();
        $categoryModel = new CategoryModel();

        $inventory = $model->findAll();
---
SELECT *
FROM `inventory`