app/Controllers/UserController.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function store()
    {
        $model = new UserModel();
        $data =[
            'username' => $this->request->getVar('username'),
            'password' => $this->request->getVar('password'),
            'role'     => $this->request->getVar('role'),
        ];
        $model->save($data);
---
INSERT INTO `users` (`username`, `password`, `role`) VALUES ('admin3', '$2y$10$atBw/5YhXNaoe7bfuQ/e4e3kWIUCEpN0zZxxEoacI7KZsgMl3QhLa', 'user')