app/Models/ActivityLogModel.php

    public function log($action, $details = '')
    {
        $this->save([
            'user_id'    => session()->get('id'),
            'username'   => session()->get('username') ?? 'Guest',
            'action'     => $action,
            'details'    => $details,
            'ip_address' => service('request')->getIPAddress()
        ]);
---
INSERT INTO `activity_logs` (`user_id`, `username`, `action`, `details`, `ip_address`, `created_at`) VALUES ('4', 'admin0', 'POS Transaction', 'Sold items to Lisa Gajo via UTANG (Total: ₱30.00)', '::1', '2026-05-12 18:17:33')